app/controllers/weeks_controller.rb

  def index
    @weeks = Week.all
---
SELECT "weeks".* FROM "weeks"

  def create
    @week = Week.new(week_params)

    respond_to do |format|
      if @week.save
---
INSERT INTO "weeks" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "halo"], ["created_at", "2022-06-18 17:20:52.066471"], ["updated_at", "2022-06-18 17:20:52.066471"]]

    def set_week
      @week = Week.find(params[:id])
---
SELECT "weeks".* FROM "weeks" WHERE "weeks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]